label scene_9:
    scene bg kras
    show shrek normal at left, shrekzoom
    show vika normal at right

    s "Поехали в Томск."

    v "Не хочу, мне и здесь нравится."

    s "Аааээээ"

    "Хорошие мысли часто преследовали Максима, но он был быстрее. Он подумал, что лучшим способом заманить Вику в Томск будет соблазнить ее."

    e "Давайте поможем Максиму соблазнить Вику! Для этого выберите те фразы, которые, как вы думаете, соблазнили бы Вику."

    e "..."

    e "..."

    e "Отлично!"

    s "Вика!"


    menu scene_9_question_1:
        "Подкат про шахматы":
            s "Смотрела ли ты Ход королевы?"

            v "Да, а что?"

            s "В шахматах ходят по очереди а после меня ты не сможешь ходить по диагонали."
            jump scene_9_part_1
        "Подкат про бедяш":
            s "Ты как беляш с вокзала."

            v "Почему?"

            s "Горячая, сочная и опасная."
            jump scene_9_question_1

    label scene_9_part_1:
        menu scene_9_question_2:
            "Подкат в стихах":
                s "Луна ярко светит отражением в реке, неудобно держать пиво, ведь твоя рука в моей руке."

                v "???"

                s "Почему ты смотришь на меня так дико, Вика, я ведь симпатичнее таджика"
                jump scene_9_question_2

            "Подкат наоборот":
                s "Теперь ты ко мне подкатываешь."

                v "Чего? А кхмм... Это у тебя меч в кармане или ты рад меня видеть?"

                s "Ох как романтично я согласен поехали в Томск."

                v "Ахахха нет."
                jump scene_9_part_2

    label scene_9_part_2:
        menu scene_9_question_3:
            "Всратый подкат":
                s "Ты как туалет."

                v "Так это уже обидно, я что, воняю?"

                s "Чем ты ближе, тем сильнее хочется."
                jump scene_9_question_3

            "Рабочий подкат 100\%":
                s "А если мы просто потусим в Томске пару дней, там крутые чуваки, смотри видосик с тусы"

                v "АХАХАХАХАХ и правда смешно. Ладно, поехали. Но больше никаких подкатов."

                s "Даю слово"
                jump scene_9_part_3
    label scene_9_part_3:
        show donkey normal at center, shrekzoom
        d "Нельзя удержать силой дождь, человека и жизнь..."

        v "Он дурачок что ли?"

        s "Кажется он намекает, что нам пора бежать."

        kr "ВЫ КУДА ЭТО СОБРАЛИСЬ??"

        s "Уходим!"

        hide shrek normal
        hide vika normal
        hide donkey normal
        show kris normal at truecenter
        with dissolve
        kr "РРррРРРРРррррРРРРррРрррр"
        return
