label scene_12:

    scene bg makar house outside

    show shrek normal at left, shrekzoom
    show vika normal at right, vikazoom

    play music "audio/scene_12_lastride.mp3" volume 0.1 loop

    s "Ну вот мы и рядом с домом Макара, где ты останешься, пока в Томске"

    v "Все нормально Максим, мы ведь сможем еще потусить."

    s "Даа, сможем. Мы ведь столько всего ещё не обсудили! Но у нас осталось мало времени."

    v "Сколько, Максим?"

    s "Только на один вопрос, Вика."

    v "Какая твоя любимая группа, Максим?"

    s "Этот вопрос я могу обсуждать часами, давай что-нибудь покороче, Вика.."

    v "Твоя любимая книга, Максим?"

    s "Да, это мы сможем обсудить за оставшееся время, Вика."

    v "Я вот недавно прочитала 'Замок из стекла' и мне так понравилось, Максим!"

    s "Этот... Погоди, что? Замок из стекла? Это же вообще не книга."

    v "Это основано на реальных событиях! И местами забавно."

    s "Да это ужасная книга! И она написана отвратительно! Я отказываюсь общаться с человеком, которому понравился 'Замок из стекла'."

    v "Ах так! Я прекрасно проведу время с Макаром и Ирой и другими людьми с того видео что ты мне показывал."

    hide vika normal

    s "А я пойду чилить к себе домой. ОДИН!"

    stop music fadeout 3.0

    hide shrek normal

    show donkey normal at center, donkeyzoom

    d "Да вы что творите?!"

    return
