label scene_8:
    scene bg kras
    show donkey normal at left, shrekzoom
    show shrek normal at right, shrekzoom
    with dissolve
    s "Значит так, я ищу Вику, ты ищешь дракона, встречаемся тут же через 15 минут."

    d "Заметано бро."

    hide shrek normal
    show kris stay at right, kriszoom

    kr "Привет, один тут отдыхаешь?"

    d "Он не поставит в жизни точки. Ничто не может быть сильней, чем сердце волка-одиночки."

    kr "Ахаха а ты смешной, давай дружить."

    d "Я верный друг, и страшный враг, смотря кому, когда и как!"

    kr "Ну я про это и говорю, затусим как-нибудь?"

    d "Братва — это не когда вас много, а когда несколько, но достойных!"

    kr "В смысле? Типа я не помещаюсь в твой список друзей? И кто там есть?"

    d "Максим, мой братан, мы с ним сериал снимаем. Я не могу отвлекаться на других людей."

    kr """
    Ты попутал, дружок-пирожок, Максим - это мой братан.
    А Вика - моя подруга, и я отсюда вижу, как Максим к ней катит.
    Вот только ничего у вас не выйдет, я ее никуда не пущу, тем более с таким
    'волчарой' как ты."""

    d "Одна ошибка - и ты ошибся..."

    return
