label scene_10:
    show shrek normal at right
    show vika normal at center
    show donkey normal at left

    v "Ребят, я шарю за автостоп, со мной быстро до Томска доберемся."

    s "Жаль что пришлось убегать так быстро, что мы не успели взять билеты на автобус."

    d "Мне кажется так даже интереснее."

    s "Я рад что ты перестал говорить цитатами."

    tn "ХА-ХАА, ПОХОЖЕ ВЫ, ДЕТИШКИ, НЕ ЗНАЕТЕ, ЧЕМ ОПАСНА ЭТА ДОРОГА."

    d "Кто здесь?"

    tn "ЭТО Я - РОБИН ГУД!"

    show robinhood alone

    rg_ "И МОИ ЛЮДИ!"

    hide robinhood alone

    show luda normal

    v "Почему ты на нас кричишь?"

    s "Хе-хе, маловато ты людей набрал, нас-то трое."

    rg "ЗА ТАКУЮ ДЕРЗОСТЬ Я ЗАБЕРАЮ ТВОЙ МИНИСК."

    s "AAAaaAAAaAAAAAAaaaaaa."

    d "Братан без миниска все еще братан, а вот без души - продаван."

    v "Не нервничай, волчара, справимся. Теперь бой равный."

    l "Ехеехех...  Ctrl + C, Ctrl + v + v + v + v + v + v"

    v "Ойёёёй..."

    return
