label scene_4:
    scene bg duloc_scene_4
    show farquaad normal at left:
        zoom 0.3
    show pryana normal at right
    with dissolve
    i "Я хочу спать"

    sk "Давайте все успокоимся и все мирно урегулируем"

    show farquaad normal at left, shake:
        linear 1.0 zoom 0.6

    i "{b}Да я не хочу успокаиваться, у меня болит голова от кальяна и Макар свалил куда-то! Он же едва ноги переставляет!{/b}"

    sk "Макар ведь не один вышел, а со всеми, ничего с ним не случится."

    i "{b}Да ты видел в каком он состоянии вышел? Он в моих ботинках ушел!{/b}"

    sk "Сейчас мы его приведем. Одна нога здесь другая там."

    hide pryana normal with dissolve

    show mirror at right
    with dissolve

    i "{b}Где ты ходишь, я вообще-то волнуюсь!{/b}"

    m "Ну Ир ну я же вот вышел в вышку я тебе супчик взял."

    i "{b}Да какой супчик, время 5 утра!{/b}"

    m "С лапшичкой"

    show farquaad normal at left:
        linear 1.0 zoom 0.3

    i "Ну если с лапшичкой тогда ладно."

    i "Спать пойдем?"

    m "ЭЭээ какой спать я к Максиму тусить поеду."

    show farquaad normal:
        linear 1.0 zoom 0.6

    i "Так что вы сразу у своего {i}Максима{/i} не собирались тогда?"

    m "Он не любит тусить, его нужно долго раскачивать..."

    i "Ладно. Проехали. Ты сделал то что я просила?"

    m "Хррррр...."

    $ renpy.play('audio/punch.opus')
    with vpunch

    i "Макар! Я с тобой разовариваю!"

    m "ммм что да я проснулся"

    i "Ты поискал девушку Максиму, чтобы она была классная веселая умная и любила тусить?"

    m "Да, вот они слева направо."

    return
