label scene_7:
    scene bg forest_road
    show shrek_donkey_bus at center
    play music ["audio/scene_7_carmen.mp3", "audio/bus_trip.wav"] volume 0.1
    s "Зачем ты поехал со мной?"

    d "Да у меня выходные сейчас, все равно дома бы сидел."

    s "Только не пойму, зачем мы поехали на автобусе, мне вот лично больше
    нравятся велосипеды..."

    d "Даа, велосипеды классные. У меня знакомый такую историю рассказывал, просто
    огонь. Все началось с того, что чувак технично угнал велосипед."

    s "Прямо угнал? И как это было?"

    d "Там короче"

    menu scene_7_question_1:
        "Просто выхватил вел на стройке":
            d "Чувак просто крикнул что технично угоняет велосипед, сел и поехал."
            s "А звучит многообещающе. Мне кажется из этого можно целый сериал создать."
            jump scene_7_part_1
        "Оглушил парня, схватил вел и убежал":
            d "Там чувак подкрался к другому чуваку, схватил его вел и убежал."
            s "Та нее, я бы такого перса попозже в сюжет ввел, сезоне в 4. Я б его даже сыграл. Это же целый сериал вырисовывается."
            jump scene_7_question_1

    label scene_7_part_1:
        d "Сериал это же супер идея!"

        s "Там же столько всего можно придумать! Друзей позвать сниматься! Вот например,
        Шибаеву ты бы какую роль отдал?"
        menu scene_7_question_2:
            "Недовольный чел с сумкой":
                d "Недовольный чел с сумкой - идеально."
                s "Да-да-да, и пусть он еще с Тауцем сцену разыгрывает, вот ор будет."
                jump scene_7_part_2
            "Недовольный чел с рюкзаком и в кепке":
                d "Недовольный чел с рюкзаком и в кепке, я думаю."
                s "Мне кажется Тауц органичнее смотрится в этой роли."
                jump scene_7_question_2

    label scene_7_part_2:
        s "Так а основной замес в чем? Главный герой почему такой мудак?"
        menu scene_7_question_3:
            "Так у него батю убили в 99. Он безотцовщина ебаная":
                d "Ну его сперва отец бросил, потом мать работала как проклятая."
                s "Я так себе его и представляю, в спортивочке, с плеером, ммм."
                jump scene_7_part_3
            "На него влияет волшебный кристалл":
                d "Он состоит в тайной организации и может телепортироваться и хочет победить Сэнсея и ..."
                s "Да брось, вообще не то, это не бандитский сериал."
                jump scene_7_question_3

    label scene_7_part_3:
        s "А тебе мы роль Хакера дадим, будешь трекеры снимать, и с Яростью вопросики обкашливать."

        d "ДААА! Это было бы очень круто Максим! Я уже готов! Я уже вжился в роль!"

        s "О, а вот и Красноярск. За душевным разговором как время летит."

        play sound "audio/message_received.wav"

        s "Мне скинули адрес, поехали сразу туда, на месте разберемся."

        stop music fadeout 3.0

        return
