label scene_14:
    scene bg duloc_scene_4
    show shrek mad at left, shrekzoom
    show farquaad normal at right

    s "Ты не выполнила свою часть сделки, а значит, я могу тусить с Викой сколько захочу!"

    ik "Мне Вика тоже нравится, я тебе ее не отдам!"

    # битва?

    v "Я вообще-то личность и сама буду решать с кем мне тусить."

    show kris fly at center, kriszoom

    kr "РРррРРРРрр кто моего Викосека украл, ты??"

    s "Это все она"

    # Съедает Иру?

    s "Вика"

    v "Что?"

    s "Ну Замок из стекла же правда отстой"

    v "Я не это хочу услышать"

    s "Вика, ты согласна жить вместе на моем болоте?"

    v "Да"

    e "Ураааа"

    v "Выплюнь Иру и будем тусеееть"

    # Поздравления с ДР?

    # Все тусят
